config/gptel/presets/registration.org
#+title: GPTEL Preset Registration
#+author: Jeff Farr
#+property: header-args:emacs-lisp :tangle registration.el
#+auto_tangle: y

* Introduction

Fragment-era preset registration for gptel. A preset is now authored as an
=.org= source (an Elisp config block plus a static role fragment) that *tangles
to an =.el= artifact*. The tangled =preset.el= renders its role fragment at
tangle time and calls [[*Register a single preset][=jf/gptel-preset-register=]]
with native-Elisp config keys and a pre-rendered =:system=. This module:

1. Provides =jf/gptel-preset-register= — the public registration entry point each
   tangled preset =.el= calls. It extracts scope and mode keys into side tables,
   then registers the preset via upstream =gptel-make-preset=.
2. Provides =jf/gptel-preset-register-all= — the loader that discovers tangled
   preset =.el= artifacts (=config/gptel/presets/<name>/preset.el=) and =load=s
   each so they self-register.

The previous YAML pipeline (file parsing, snake-case key normalization, and
value coercion) is *deleted*: Elisp config carries native types and needs no
parsing / normalization / coercion (design §Decision 6). Scope and mode
extraction are *retained* — they now read native Elisp directly. This module
introduces *no* yaml dependency.

This module supersedes the former =config/gptel/preset-registration.org=. It
sits after the fragment renderer (=presets/fragments.el=) in the gptel load
order so that any preset =.el= relying on the renderer at load time can find it.

* Lexical Binding

#+begin_src emacs-lisp :comments no
;;; registration.el --- GPTEL Preset Registration -*- lexical-binding: t; -*-

;; Copyright (C) 2024-2026 Jeff Farr

;; Author: Jeff Farr
;; Keywords: gptel, llm, presets

;;; Commentary:

;; Fragment-era preset registration.  Each preset .org tangles to an .el that
;; renders its role fragment at tangle time and calls `jf/gptel-preset-register'
;; with native-Elisp config and a pre-rendered :system.  This module extracts
;; scope/mode keys into side tables and registers via `gptel-make-preset'.
;; The YAML parse/normalize/coerce pipeline has been removed.

;;; Code:

(require 'cl-lib)
(require 'seq)
#+end_src

* Scope Defaults Storage

Alist mapping preset name symbols to scope plists extracted during registration.
Scope keys (=:paths=, =:shell-commands=, =:bash-tools=, =:scope-profile=) are
stripped from the preset plist and stored here for later use by the scope
subsystem (=jf/gptel-scope-profile--resolve= in =scope-profiles.org= reads this
alist). The legacy =:org-roam-patterns= key is *not* a scope key and is never
extracted; a preset that still carries it triggers a =display-warning= but is
otherwise registered without the legacy section flowing into scope-defaults.

#+begin_src emacs-lisp
(defvar jf/gptel-preset--scope-defaults nil
  "Alist mapping preset name symbols to scope plists.
Each entry is (PRESET-NAME . SCOPE-PLIST) where SCOPE-PLIST contains
keys :paths, :shell-commands, :bash-tools, :scope-profile that were
extracted from the preset config during registration.  The legacy
:org-roam-patterns key is not extracted; see
`jf/gptel-preset--extract-scope' for the legacy-key warning behavior.")
#+end_src

* Mode Defaults Storage

Alist mapping preset name symbols to mode plists extracted during registration.
The =:mode= key is stripped from the preset plist and stored here for later use
by the session subsystem when determining file format (org-mode vs
markdown-mode). Defaults to ="org-mode"= when a preset does not declare =:mode=.

#+begin_src emacs-lisp
(defvar jf/gptel-preset--mode-defaults nil
  "Alist mapping preset name symbols to mode plists.
Each entry is (PRESET-NAME . MODE-PLIST) where MODE-PLIST contains
the :mode key extracted from the preset config during registration.
Valid :mode values are \"org-mode\" and \"markdown-mode\".
Defaults to \"org-mode\" when not specified in the preset.")
#+end_src

* Extract Scope

Strip scope-related keys from the config plist and store them in
=jf/gptel-preset--scope-defaults=. Reads native Elisp keys directly — there is no
YAML normalization step preceding extraction.

#+begin_src emacs-lisp
(defun jf/gptel-preset--extract-scope (plist preset-name)
  "Extract scope keys from PLIST and store under PRESET-NAME.
Scope keys are :paths, :shell-commands, :bash-tools, and :scope-profile.
If any scope keys are present, store them in `jf/gptel-preset--scope-defaults'
keyed by PRESET-NAME (a symbol).
Return a new plist with scope keys removed.

Legacy keys (currently `:org-roam-patterns'): cycle-3 removed pattern-based
validation from the scope subsystem; the key no longer has a consumer.  Presets
that still carry it trigger a `display-warning' naming the preset and the
ignored key, and the key is dropped from both the scope plist and the returned
config (it is not a scope key, so it never reaches scope-defaults)."
  (let ((scope-keys '(:paths :shell-commands :bash-tools :scope-profile))
        (legacy-scope-keys '(:org-roam-patterns))
        (scope-plist nil)
        (legacy-keys-present nil)
        (result nil))
    ;; Walk the plist once: collect live scope keys, note legacy keys (and
    ;; drop them from both scope-plist and result), pass through everything
    ;; else.
    (let ((remaining plist))
      (while remaining
        (let ((key (pop remaining))
              (val (pop remaining)))
          (cond
           ((memq key legacy-scope-keys)
            (push key legacy-keys-present))
           ((memq key scope-keys)
            (setq scope-plist (plist-put scope-plist key val)))
           (t
            (setq result (plist-put result key val)))))))
    ;; Surface legacy keys via display-warning so the user can clean up.
    (when legacy-keys-present
      (display-warning
       'jf-gptel-preset
       (format "Preset %S carries legacy scope key(s) %S; the key(s) are ignored. Remove from the preset definition."
               preset-name (nreverse legacy-keys-present))
       :warning))
    ;; Store scope defaults if any live scope keys were found.
    (when scope-plist
      (let ((existing (assq preset-name jf/gptel-preset--scope-defaults)))
        (if existing
            (setcdr existing scope-plist)
          (push (cons preset-name scope-plist) jf/gptel-preset--scope-defaults))))
    result))
#+end_src

* Extract Mode

Strip the =:mode= key from the config plist and store it in
=jf/gptel-preset--mode-defaults=. Defaults to ="org-mode"= when not specified.

#+begin_src emacs-lisp
(defun jf/gptel-preset--extract-mode (plist preset-name)
  "Extract :mode key from PLIST and store under PRESET-NAME.
If :mode is present, validate it and store in `jf/gptel-preset--mode-defaults'
keyed by PRESET-NAME (a symbol).  If :mode is absent, store the default
\"org-mode\".  Valid values are \"org-mode\" and \"markdown-mode\".
Return a new plist with :mode removed."
  (let ((mode-val (plist-get plist :mode))
        (result nil))
    ;; Build result plist without :mode.
    (let ((remaining plist))
      (while remaining
        (let ((key (pop remaining))
              (val (pop remaining)))
          (unless (eq key :mode)
            (setq result (plist-put result key val))))))
    ;; Default to "org-mode" if not specified.
    (let ((effective-mode (or mode-val "org-mode")))
      ;; Validate.
      (unless (member effective-mode '("org-mode" "markdown-mode"))
        (when (fboundp 'jf/gptel--log)
          (jf/gptel--log 'warn "Preset %s has invalid :mode \"%s\", defaulting to org-mode"
                         preset-name effective-mode))
        (setq effective-mode "org-mode"))
      ;; Store in side table.
      (let ((mode-plist (list :mode effective-mode))
            (existing (assq preset-name jf/gptel-preset--mode-defaults)))
        (if existing
            (setcdr existing mode-plist)
          (push (cons preset-name mode-plist) jf/gptel-preset--mode-defaults))))
    result))
#+end_src

* Shared Directory Loader and Load-Error Fail-Policy

The two directory loaders below — =jf/gptel-preset-register-all= (descends
=<name>/preset.el=) and =jf/gptel-fragment--load-sources-all= (globs flat
=sources/*.el=) — share their entire skeleton: check the directory exists,
discover the entries, =load= each one inside a =condition-case=, count the
successes, and log the total. They also shared a *defect*: a single entry whose
=.el= signalled on load was swallowed with only a *warn*-level log, leaving the
composer seam that entry was meant to populate at its dark default
(=#'ignore= for the env seam; an unregistered preset for the preset seam) —
the exact dark-seam outcome these loaders exist to prevent, now reachable via a
runtime load error instead of a missing load step.

This section extracts ONE shared helper, =jf/gptel--load-directory=, that both
loaders route through. It owns directory globbing, the per-entry
=condition-case=, and the **non-silent load-error fail-policy**:

- A single bad entry does *not* hard-fail the load — the remaining entries still
  load, so one broken source/preset never darkens the whole of gptel init.
- A load error is logged at **error** level (not warn), naming the *file* AND
  the *seam* it failed to populate.
- The failure is *recorded* in =jf/gptel--loader-failures= so a post-init
  self-check (=jf/gptel-loader-seam-dark-p=) can assert "N entr(ies) failed;
  seam X is dark" rather than the failure being silently warn-and-forgotten.

The recorded-failure approach (over fail-loud re-signal) is deliberate: the
cited boundary contract for both loaders is "a single bad source/preset SHOULD
NOT hard-fail all of gptel init", and gptel init runs unattended at startup —
re-signalling would abort the whole subsystem on one bad entry. Recording +
error-logging keeps the failure loud and *detectable* without taking down the
seams that loaded fine.

