config/gptel/presets/registration.el
;;; registration.el --- GPTEL Preset Registration -*- lexical-binding: t; -*-

;; Copyright (C) 2024-2026 Jeff Farr

;; Author: Jeff Farr
;; Keywords: gptel, llm, presets

;;; Commentary:

;; Fragment-era preset registration.  Each preset .org tangles to an .el that
;; renders its role fragment at tangle time and calls `jf/gptel-preset-register'
;; with native-Elisp config and a pre-rendered :system.  This module extracts
;; scope/mode keys into side tables and registers via `gptel-make-preset'.
;; The YAML parse/normalize/coerce pipeline has been removed.

;;; Code:

(require 'cl-lib)
(require 'seq)

(defvar jf/gptel-preset--scope-defaults nil
  "Alist mapping preset name symbols to scope plists.
Each entry is (PRESET-NAME . SCOPE-PLIST) where SCOPE-PLIST contains
keys :paths, :shell-commands, :bash-tools, :scope-profile that were
extracted from the preset config during registration.  The legacy
:org-roam-patterns key is not extracted; see
`jf/gptel-preset--extract-scope' for the legacy-key warning behavior.")

(defvar jf/gptel-preset--mode-defaults nil
  "Alist mapping preset name symbols to mode plists.
Each entry is (PRESET-NAME . MODE-PLIST) where MODE-PLIST contains
the :mode key extracted from the preset config during registration.
Valid :mode values are \"org-mode\" and \"markdown-mode\".
Defaults to \"org-mode\" when not specified in the preset.")

(defun jf/gptel-preset--extract-scope (plist preset-name)
  "Extract scope keys from PLIST and store under PRESET-NAME.
Scope keys are :paths, :shell-commands, :bash-tools, and :scope-profile.
If any scope keys are present, store them in `jf/gptel-preset--scope-defaults'
keyed by PRESET-NAME (a symbol).
Return a new plist with scope keys removed.

Legacy keys (currently `:org-roam-patterns'): cycle-3 removed pattern-based
validation from the scope subsystem; the key no longer has a consumer.  Presets
that still carry it trigger a `display-warning' naming the preset and the
ignored key, and the key is dropped from both the scope plist and the returned
config (it is not a scope key, so it never reaches scope-defaults)."
  (let ((scope-keys '(:paths :shell-commands :bash-tools :scope-profile))
        (legacy-scope-keys '(:org-roam-patterns))
        (scope-plist nil)
        (legacy-keys-present nil)
        (result nil))
    ;; Walk the plist once: collect live scope keys, note legacy keys (and
    ;; drop them from both scope-plist and result), pass through everything
    ;; else.
    (let ((remaining plist))
      (while remaining
        (let ((key (pop remaining))
              (val (pop remaining)))
          (cond
           ((memq key legacy-scope-keys)
            (push key legacy-keys-present))
           ((memq key scope-keys)
            (setq scope-plist (plist-put scope-plist key val)))
           (t
            (setq result (plist-put result key val)))))))
    ;; Surface legacy keys via display-warning so the user can clean up.
    (when legacy-keys-present
      (display-warning
       'jf-gptel-preset
       (format "Preset %S carries legacy scope key(s) %S; the key(s) are ignored. Remove from the preset definition."
               preset-name (nreverse legacy-keys-present))
       :warning))
    ;; Store scope defaults if any live scope keys were found.
    (when scope-plist
      (let ((existing (assq preset-name jf/gptel-preset--scope-defaults)))
        (if existing
            (setcdr existing scope-plist)
          (push (cons preset-name scope-plist) jf/gptel-preset--scope-defaults))))
    result))

(defun jf/gptel-preset--extract-mode (plist preset-name)
  "Extract :mode key from PLIST and store under PRESET-NAME.
If :mode is present, validate it and store in `jf/gptel-preset--mode-defaults'
keyed by PRESET-NAME (a symbol).  If :mode is absent, store the default
\"org-mode\".  Valid values are \"org-mode\" and \"markdown-mode\".
Return a new plist with :mode removed."
  (let ((mode-val (plist-get plist :mode))
        (result nil))
    ;; Build result plist without :mode.
    (let ((remaining plist))
      (while remaining
        (let ((key (pop remaining))
              (val (pop remaining)))
          (unless (eq key :mode)
            (setq result (plist-put result key val))))))
    ;; Default to "org-mode" if not specified.
    (let ((effective-mode (or mode-val "org-mode")))
      ;; Validate.
      (unless (member effective-mode '("org-mode" "markdown-mode"))
        (when (fboundp 'jf/gptel--log)
          (jf/gptel--log 'warn "Preset %s has invalid :mode \"%s\", defaulting to org-mode"
                         preset-name effective-mode))
        (setq effective-mode "org-mode"))
      ;; Store in side table.
      (let ((mode-plist (list :mode effective-mode))
            (existing (assq preset-name jf/gptel-preset--mode-defaults)))
        (if existing
            (setcdr existing mode-plist)
          (push (cons preset-name mode-plist) jf/gptel-preset--mode-defaults))))
    result))
