config/gptel/presets/registration.org
** Failure registry

#+begin_src emacs-lisp
(defvar jf/gptel--loader-failures nil
  "List of load-error failure records from the directory loaders.
Each element is a plist (:file FILE :seam SEAM :error MESSAGE) recorded
by `jf/gptel--load-directory' when an entry's `.el' signals on load.
SEAM is the composer-seam symbol that entry failed to populate (e.g.
`jf/gptel-fragment-environment-fn' for a fragment source,
`gptel--known-presets' for a preset).  A post-init self-check
(`jf/gptel-loader-seam-dark-p') reads this to report which seams are
dark.  Cleared with `jf/gptel-loader-clear-failures'.")
#+end_src

#+begin_src emacs-lisp
(defun jf/gptel-loader-clear-failures ()
  "Clear the recorded directory-loader failure registry.
Call before a fresh (re-)load pass so stale failures from a previous
pass do not linger in `jf/gptel--loader-failures'."
  (setq jf/gptel--loader-failures nil))
#+end_src

#+begin_src emacs-lisp
(defun jf/gptel-loader-failures (&optional seam)
  "Return recorded directory-loader failures.
With SEAM non-nil, return only the failure records whose :seam matches
SEAM; otherwise return all records.  Each record is a plist
\(:file FILE :seam SEAM :error MESSAGE)."
  (if seam
      (seq-filter (lambda (rec) (eq (plist-get rec :seam) seam))
                  jf/gptel--loader-failures)
    jf/gptel--loader-failures))
#+end_src

#+begin_src emacs-lisp
(defun jf/gptel-loader-seam-dark-p (seam)
  "Return non-nil if SEAM has a recorded load failure.
A truthy result means at least one entry that should have populated SEAM
failed to load, so SEAM may still hold its dark default.  This is the
post-init self-check the load-error fail-policy exposes: callers can
assert seams are live, or surface which seams are dark, instead of a
silent warn-and-continue."
  (and (jf/gptel-loader-failures seam) t))
#+end_src

** Shared glob-and-load helper

#+begin_src emacs-lisp
(defun jf/gptel--load-directory (directory discover-fn seam label)
  "Load every entry DISCOVER-FN finds under DIRECTORY, guarding each load.
DISCOVER-FN is a function of one argument (DIRECTORY) returning the
ordered list of `.el' files to `load'.  SEAM is the composer-seam symbol
the loaded entries are expected to populate (used in error logs and
recorded against failures).  LABEL is a short human string for log
messages (e.g. \"fragment source\", \"preset\").

Each entry is `load'ed inside a `condition-case'.  A load that signals is
NOT swallowed silently: it is logged at ERROR level naming the file and
SEAM, and recorded in `jf/gptel--loader-failures' so
`jf/gptel-loader-seam-dark-p' can report SEAM as dark.  One bad entry
does not abort the others.

A missing DIRECTORY is a graceful no-op (warn-logged) returning 0.
Returns the count of entries that loaded successfully."
  (let ((count 0))
    (if (or (null directory) (not (file-directory-p directory)))
        (when (fboundp 'jf/gptel--log)
          (jf/gptel--log 'warn "%s directory does not exist: %s"
                         (capitalize label) directory))
      (dolist (entry (funcall discover-fn directory))
        (when (file-readable-p entry)
          (condition-case err
              (progn
                (load entry nil t)
                (setq count (1+ count)))
            (error
             (let ((msg (error-message-string err)))
               (when (fboundp 'jf/gptel--log)
                 (jf/gptel--log
                  'error
                  "Error loading %s %s: %s (seam %s left unpopulated)"
                  label entry msg seam))
               (push (list :file entry :seam seam :error msg)
                     jf/gptel--loader-failures))))))
      (when (fboundp 'jf/gptel--log)
        (jf/gptel--log 'info "Loaded %d %s(s) from %s"
                       count label directory)))
    count))
#+end_src

* Register a Single Preset

The public registration entry point. Each tangled preset =.el= calls this with
its name symbol and a native-Elisp config plist (already carrying =:system= as
the rendered role text). Scope and mode keys are extracted into the side tables;
the remaining config is handed to upstream =gptel-make-preset=.

Registration is idempotent: =gptel-make-preset= keys =gptel--known-presets= by
NAME, so re-loading a preset =.el= (after an edit + re-tangle) updates the
existing entry rather than duplicating it.

#+begin_src emacs-lisp
(defun jf/gptel-preset-register (name &rest config)
  "Register the preset NAME with native-Elisp CONFIG.
NAME is a symbol (typically the preset's source basename).  CONFIG is a
plist of native-Elisp gptel-preset keys; :system, when present, is the
preset's pre-rendered role text.

Scope keys (:paths :shell-commands :bash-tools :scope-profile) are
extracted into `jf/gptel-preset--scope-defaults' and removed from the
plist; the legacy :org-roam-patterns key is dropped (see
`jf/gptel-preset--extract-scope').  The :mode key is extracted into
`jf/gptel-preset--mode-defaults' (default \"org-mode\").  The remaining
config is registered via upstream `gptel-make-preset', keyed by NAME.

Idempotent: re-calling with the same NAME updates the existing entry.
Returns NAME."
  (let* ((scope-cleaned (jf/gptel-preset--extract-scope config name))
         (cleaned (jf/gptel-preset--extract-mode scope-cleaned name)))
    (apply #'gptel-make-preset name cleaned)
    name))
#+end_src

* Register All Presets

Discover and load the tangled preset =.el= artifacts so each self-registers.
Preset sources live one-per-subdirectory under =jf/gptel-presets-directory= as
=<name>/preset.org= tangling to =<name>/preset.el=; the preset name is the
subdirectory basename. The loader =load=s each =preset.el= (which calls
=jf/gptel-preset-register=). =load=ing is idempotent at the registration layer.

Discovery (which =<name>/preset.el= files exist) is its own thin function so
the shared =jf/gptel--load-directory= helper owns only globbing + the per-entry
guard; the subdir-descent shape stays here.

#+begin_src emacs-lisp
(defun jf/gptel-preset--discover-preset-els (presets-dir)
  "Return the list of `<name>/preset.el' files under PRESETS-DIR.
Descends each immediate subdirectory of PRESETS-DIR and collects its
`preset.el' (the tangled, self-registering preset artifact).
Subdirectories without a `preset.el' are skipped.  This is the
discovery half of `jf/gptel-preset-register-all'; the load + fail-policy
half lives in `jf/gptel--load-directory'."
  (let (entries)
    (dolist (subdir (directory-files presets-dir t directory-files-no-dot-files-regexp))
      (when (file-directory-p subdir)
        (let ((preset-el (expand-file-name "preset.el" subdir)))
          (when (file-exists-p preset-el)
            (push preset-el entries)))))
    (nreverse entries)))
#+end_src

#+begin_src emacs-lisp
(defun jf/gptel-preset-register-all ()
  "Load all tangled preset .el artifacts so they self-register.
Discovers `<jf/gptel-presets-directory>/<name>/preset.el' files and
`load's each.  Each preset.el renders its role fragment (at tangle time)
and calls `jf/gptel-preset-register', which extracts scope/mode keys and
registers via `gptel-make-preset'.

This function is idempotent -- re-loading a preset.el updates the
existing entry.  Routes through `jf/gptel--load-directory', which owns the
per-entry `condition-case' and the non-silent load-error fail-policy: a
preset whose .el signals on load is logged at ERROR level and recorded in
`jf/gptel--loader-failures' (seam `gptel--known-presets'), not silently
swallowed.  Logs the count of loaded preset artifacts."
  (interactive)
  (jf/gptel--load-directory
   (and (boundp 'jf/gptel-presets-directory) jf/gptel-presets-directory)
   #'jf/gptel-preset--discover-preset-els
   'gptel--known-presets
   "preset"))
#+end_src

