config/gptel/presets/registration.org
* Load All Fragment Sources

Fragment SOURCE modules live as *flat* =.el= files under
=config/gptel/presets/sources/= (e.g. =environment.el= today; =emacs-prelude.el=
/ =agent-preamble.el= next). Each source =load=s the renderer feature
(=jf-gptel-fragments=) and then populates a composer seam as a side effect — the
dynamic =jf/gptel-fragment-environment-fn= today, the static prelude/preamble
seam vars next. Unlike presets (one per =<name>/= subdirectory), sources are not
self-registering into a side table and have no subdirectory-per-source layout, so
this loader enumerates the flat =sources/*.el= rather than descending
=<name>/preset.el=.

This is a *directory* loader by design (mirrors
=jf/gptel-preset-register-all='s discovery, applied to a flat dir): adding a new
source =.el= requires no further =gptel.org= edit. Sources are loaded in
=string<= (sorted) filename order for determinism; today no inter-source ordering
dependency exists (each source only depends on =jf-gptel-fragments=, which
=gptel.org= loads before calling this), so sort order is incidental, not
load-bearing.

The caller in =gptel.org= sequences this AFTER =presets/fragments.el= (the
composer/renderer that =defvar='s the seams) and BEFORE the chat/agent/env
consumers that read those seams. =load=ing a source =provide='s its feature, so
=menu.el='s soft =(require 'jf-gptel-fragment-environment nil t)= resolves
naturally after init.

#+begin_src emacs-lisp
(defvar jf/gptel-fragment-sources-directory
  (and (boundp 'jf/gptel-presets-directory)
       (expand-file-name "sources/" jf/gptel-presets-directory))
  "Directory holding flat fragment SOURCE .el files.
Each file under this directory is `load'ed at gptel init by
`jf/gptel-fragment--load-sources-all' so its composer-seam side effect
runs in production.  Derived from `jf/gptel-presets-directory'.")
#+end_src

#+begin_src emacs-lisp
(defun jf/gptel-fragment--load-sources-all ()
  "Load every fragment SOURCE .el under `jf/gptel-fragment-sources-directory'.
Sources are flat `.el' files (not `<name>/' subdirs); each `load's the
renderer feature and populates a composer seam as a side effect.  Files
are loaded once each, in sorted filename order (no inter-source ordering
dependency exists today).  Must be called AFTER `presets/fragments.el'
(which defines the seam vars) and BEFORE the chat/agent/env consumers.

Idempotent at the source layer: re-loading a source re-runs its
seam-population `setq', which is the same assignment.  Routes through
`jf/gptel--load-directory', which owns the per-entry `condition-case' and
the non-silent load-error fail-policy: a source whose .el signals on load
is logged at ERROR level and recorded in `jf/gptel--loader-failures'
\(seam `jf/gptel-fragment-environment-fn'), not silently swallowed.  Logs
the count of loaded sources.  Returns the count."
  (interactive)
  (jf/gptel--load-directory
   jf/gptel-fragment-sources-directory
   #'jf/gptel-fragment--discover-source-els
   'jf/gptel-fragment-environment-fn
   "fragment source"))
#+end_src

The discovery half (which =sources/*.el= exist, in sorted order) is its own
thin function, parallel to =jf/gptel-preset--discover-preset-els=; the shared
helper owns only the load + fail-policy.

#+begin_src emacs-lisp
(defun jf/gptel-fragment--discover-source-els (sources-dir)
  "Return the flat `.el' files under SOURCES-DIR in sorted filename order.
Fragment SOURCE modules are flat `.el' files (not `<name>/' subdirs).
Sorted with `string<' for determinism; no inter-source ordering
dependency exists today.  This is the discovery half of
`jf/gptel-fragment--load-sources-all'; the load + fail-policy half lives
in `jf/gptel--load-directory'."
  (sort (directory-files sources-dir t "\\.el\\'") #'string<))
#+end_src

* Provide Feature

The =gptel-preset-registration= feature name is preserved from the superseded
module so existing =(require 'gptel-preset-registration ...)= call sites continue
to resolve.

#+begin_src emacs-lisp
(provide 'gptel-preset-registration)
;;; registration.el ends here
#+end_src
