config/gptel/presets/registration.el

(defvar jf/gptel-fragment-sources-directory
  (and (boundp 'jf/gptel-presets-directory)
       (expand-file-name "sources/" jf/gptel-presets-directory))
  "Directory holding flat fragment SOURCE .el files.
Each file under this directory is `load'ed at gptel init by
`jf/gptel-fragment--load-sources-all' so its composer-seam side effect
runs in production.  Derived from `jf/gptel-presets-directory'.")

(defun jf/gptel-fragment--load-sources-all ()
  "Load every fragment SOURCE .el under `jf/gptel-fragment-sources-directory'.
Sources are flat `.el' files (not `<name>/' subdirs); each `load's the
renderer feature and populates a composer seam as a side effect.  Files
are loaded once each, in sorted filename order (no inter-source ordering
dependency exists today).  Must be called AFTER `presets/fragments.el'
(which defines the seam vars) and BEFORE the chat/agent/env consumers.

Idempotent at the source layer: re-loading a source re-runs its
seam-population `setq', which is the same assignment.  Routes through
`jf/gptel--load-directory', which owns the per-entry `condition-case' and
the non-silent load-error fail-policy: a source whose .el signals on load
is logged at ERROR level and recorded in `jf/gptel--loader-failures'
\(seam `jf/gptel-fragment-environment-fn'), not silently swallowed.  Logs
the count of loaded sources.  Returns the count."
  (interactive)
  (jf/gptel--load-directory
   jf/gptel-fragment-sources-directory
   #'jf/gptel-fragment--discover-source-els
   'jf/gptel-fragment-environment-fn
   "fragment source"))

(defun jf/gptel-fragment--discover-source-els (sources-dir)
  "Return the flat `.el' files under SOURCES-DIR in sorted filename order.
Fragment SOURCE modules are flat `.el' files (not `<name>/' subdirs).
Sorted with `string<' for determinism; no inter-source ordering
dependency exists today.  This is the discovery half of
`jf/gptel-fragment--load-sources-all'; the load + fail-policy half lives
in `jf/gptel--load-directory'."
  (sort (directory-files sources-dir t "\\.el\\'") #'string<))

(provide 'gptel-preset-registration)
;;; registration.el ends here
